namespace Base.Util.Common.Models.WebApi
{
    /// <summary>
    /// 自定义系统错误代码
    /// 10000-19999 编译级错误   提示
    /// 20000-29999 操作级错误   一般
    /// 30000-39999 功能级错误   严重
    /// 40000-49999 系统级错误   致命
    /// </summary>
    public enum SystemErrorCode
    {
        #region 10000-19999 编译级错误   提示

        编译错误 = 10000,

        #endregion

        #region 20000-29999 操作级错误   一般

        操作错误 = 20000,

        表单验证失败 = 20001,
        参数为空 = 20002,
        参数重复 = 20003,
        参数不合格 = 20004,
        验证信息为空 = 20005,
        验证信息不正确 = 20006,
        权限错误 = 20007,
        重复提交错误 = 20008,


        上传文件错误 = 21000,

        #endregion

        #region 30000-39999 功能级错误   严重

        功能错误 = 30000,

        数据为空 = 30001,
        数据重复 = 30002,
        数据错误 = 30003,
        数据禁用 = 30004,
        数据不可删除 = 30005,
        不具备数据操作权限 = 30010,
        数据添加失败 = 30011,
        数据修改失败 = 30012,
        数据删除失败 = 30013,


        数据规则错误 = 30101,


        加密错误 = 31000,
        解密错误 = 31001,
        短信错误 = 31002,

        #endregion

        #region 40000-49999 系统级错误   致命

        系统错误 = 40000,
        接口调用错误 = 40001,



        ORM错误 = 41001,
        AutoMapper映射错误 = 41002,
        #endregion
    }
}
